In [74]:
#importing necessary libraries
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

Loading the dataset

In [75]:
data = pd.read_csv('Datasets/adult_student_version 1(in).csv')

In [76]:
data.head()

,age,workclass,fnlwgt,education,education.num,marital.status,occupation,relationship,race,sex,capital.gain,capital.loss,hours.per.week,native.country,income,student_id,lucky_number,hobby_code
0,90.0,?,77053.0,HS-grad,9.0,Widowed,?,Not-in-family,White,NaN,0.0,4356.0,40.0,United-States,<=50K,1,202.0,A
1,82.0,Private,132870.0,HS-grad,9.0,NaN,NaN,Not-in-family,White,Female,0.0,4356.0,18.0,United-States,<=50K,2,535.0,A
2,66.0,?,186061.0,Some-college,10.0,Widowed,?,Unmarried,Black,Female,0.0,NaN,40.0,United-States,<=50K,3,960.0,C
3,54.0,Private,140359.0,7th-8th,4.0,Divorced,Machine-op-inspct,Unmarried,White,Female,NaN,3900.0,40.0,United-States,<=50K,4,370.0,A
4,41.0,Private,264663.0,Some-college,10.0,Separated,Prof-specialty,Own-child,White,Female,0.0,3900.0,40.0,United-States,0,5,206.0,A

In [77]:
data["age"].median()

np.float64(37.0)

In [78]:
final_data=data[["age","education", "workclass","occupation","capital.gain","capital.loss","hours.per.week","income"]]
final_data

,age,education,workclass,occupation,capital.gain,capital.loss,hours.per.week,income
0,90.0,HS-grad,?,?,0.0,4356.0,40.0,<=50K
1,82.0,HS-grad,Private,NaN,0.0,4356.0,18.0,<=50K
2,66.0,Some-college,?,?,0.0,NaN,40.0,<=50K
3,54.0,7th-8th,Private,Machine-op-inspct,NaN,3900.0,40.0,<=50K
4,41.0,Some-college,Private,Prof-specialty,0.0,3900.0,40.0,0
...,...,...,...,...,...,...,...,...
33207,18.0,Some-college,?,?,0.0,0.0,40.0,<=50K
33208,57.0,Masters,Local-gov,Prof-specialty,0.0,1977.0,40.0,>50K
33209,38.0,7th-8th,Private,Farming-fishing,0.0,0.0,40.0,<=50K
33210,31.0,HS-grad,State-gov,NaN,0.0,NaN,40.0,0
33211,43.0,Bachelors,State-gov,Exec-managerial,0.0,0.0,55.0,>50K

Checking for Null values

In [42]:
final_data.isnull().sum()

age               1668
education         1667
workclass         1658
occupation        1671
capital.gain      1661
capital.loss      1668
hours.per.week    1656
income               0
dtype: int64

Handling Null Values

In [ ]:
#handling values of workclass
final_data=final_data[final_data['workclass']!="?"]

In [104]:
final_data

,age,education,workclass,occupation,capital.gain,capital.loss,hours.per.week,income
1,82.0,HS-grad,Private,Prof-specialty,0.0,4356.0,18.0,<=50K
3,54.0,7th-8th,Private,Machine-op-inspct,0.0,3900.0,40.0,<=50K
4,41.0,Some-college,Private,Prof-specialty,0.0,3900.0,40.0,0
5,34.0,HS-grad,Private,Other-service,0.0,3770.0,45.0,0
6,38.0,10th,Private,Adm-clerical,0.0,3770.0,40.0,0
...,...,...,...,...,...,...,...,...
33206,51.0,HS-grad,Private,Other-service,0.0,0.0,37.0,<=50K
33208,57.0,Masters,Local-gov,Prof-specialty,0.0,1977.0,40.0,>50K
33209,38.0,7th-8th,Private,Farming-fishing,0.0,0.0,40.0,<=50K
33210,31.0,HS-grad,State-gov,Prof-specialty,0.0,0.0,40.0,0
33211,43.0,Bachelors,State-gov,Exec-managerial,0.0,0.0,55.0,>50K

In [90]:
final_data= final_data[final_data['occupation']!="?"]

In [101]:
final_data=final_data[final_data['workclass']!="?"]

In [132]:
#again checking for null values
final_data.isna().sum()

age               0
education         0
workclass         0
occupation        0
capital.gain      0
capital.loss      0
hours.per.week    0
income            0
dtype: int64

In [110]:
final_data.isnull().sum()

age               0
education         0
workclass         0
occupation        0
capital.gain      0
capital.loss      0
hours.per.week    0
income            0
dtype: int64

In [109]:
median_hours = final_data['hours.per.week'].median()
final_data['hours.per.week']=final_data['hours.per.week'].fillna(median_hours)

In [107]:
max_workclass=final_data['workclass'].mode()[0]
final_data['workclass']=final_data['workclass'].fillna(max_workclass)

In [93]:
max_occupation = final_data['occupation'].mode()[0]
final_data['occupation']=final_data['occupation'].fillna(max_occupation)

In [81]:
median_age = final_data['age'].median()
final_data['age']=final_data['age'].fillna(median_age)

C:\Users\299957\AppData\Local\Temp\ipykernel_31308\1534070952.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  final_data['age']=final_data['age'].fillna(median_age)

In [ ]:
#replacing null values with median
median_cap_gain = final_data['capital.gain'].median()
median_cap_loss = final_data['capital.loss'].median()
final_data['capital.gain']=final_data['capital.gain'].fillna(median_cap_gain)
final_data['capital.loss']=final_data['capital.loss'].fillna(median_cap_loss)

In [83]:
final_data["age"].isna().sum()

np.int64(0)

In [84]:
final_data["age"]

1        82.0
3        54.0
4        41.0
5        34.0
6        38.0
         ...
33206    51.0
33208    57.0
33209    38.0
33210    31.0
33211    43.0
Name: age, Length: 31415, dtype: float64

In [88]:
max_edu = final_data['education'].mode()[0]
final_data['education']=final_data['education'].fillna(max_edu)

C:\Users\299957\AppData\Local\Temp\ipykernel_31308\2155888214.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  final_data['education']=final_data['education'].fillna(max_edu)

In [89]:
final_data['education'].isnull().sum()

np.int64(0)

In [ ]:
final_data.drop()

In [111]:
final_data['income'].value_counts()

income
<=50K    16509
0         7021
>50K      5470
1         2333
Name: count, dtype: int64

In [112]:
final_data['income']= final_data['income'].map({'0':'<=50K', '1':'>50k'})

In [113]:
final_data['income'].value_counts()

income
<=50K    7021
>50k     2333
Name: count, dtype: int64

In [ ]:
from sklearn.preprocessing import LabelEncoder


categorical_columns = ["education", "occupation", "workclass"]

le = LabelEncoder()

final_data['education']=le.fit_transform(final_data['education'])
final_data['occupation']=le.fit_transform(final_data['occupation'])
final_data['workclass']=le.fit_transform(final_data['workclass'])

final_data

,age,education,workclass,occupation,capital.gain,capital.loss,hours.per.week,income
1,82.0,11,2,9,0.0,4356.0,18.0,NaN
3,54.0,5,2,6,0.0,3900.0,40.0,NaN
4,41.0,15,2,9,0.0,3900.0,40.0,<=50K
5,34.0,11,2,7,0.0,3770.0,45.0,<=50K
6,38.0,0,2,0,0.0,3770.0,40.0,<=50K
...,...,...,...,...,...,...,...,...
33206,51.0,11,2,7,0.0,0.0,37.0,NaN
33208,57.0,12,1,9,0.0,1977.0,40.0,NaN
33209,38.0,5,2,4,0.0,0.0,40.0,NaN
33210,31.0,11,5,9,0.0,0.0,40.0,<=50K
33211,43.0,9,5,3,0.0,0.0,55.0,NaN

In [118]:
final_data.head()

,age,education,workclass,occupation,capital.gain,capital.loss,hours.per.week,income
1,82.0,HS-grad,Private,Prof-specialty,0.0,4356.0,18.0,NaN
3,54.0,7th-8th,Private,Machine-op-inspct,0.0,3900.0,40.0,NaN
4,41.0,Some-college,Private,Prof-specialty,0.0,3900.0,40.0,<=50K
5,34.0,HS-grad,Private,Other-service,0.0,3770.0,45.0,<=50K
6,38.0,10th,Private,Adm-clerical,0.0,3770.0,40.0,<=50K

In [ ]:

final_data = final_data.dropna(subset=["income"])


final_data = final_data[final_data['income'] != 'NaN']


final_data = final_data.reset_index(drop=True)


print(final_data.head())
print("Remaining rows:", final_data.shape[0])

    age  education  workclass  occupation  capital.gain  capital.loss  \
0  41.0         15          2           9           0.0        3900.0
1  34.0         11          2           7           0.0        3770.0
2  38.0          0          2           0           0.0        3770.0
3  45.0         10          2           9           0.0        3004.0
4  32.0         12          2           3           0.0        2824.0

   hours.per.week income
0            40.0  <=50K
1            45.0  <=50K
2            40.0  <=50K
3            35.0   >50k
4            55.0   >50k
Remaining rows: 9354

In [125]:
final_data

,age,education,workclass,occupation,capital.gain,capital.loss,hours.per.week,income
0,41.0,15,2,9,0.0,3900.0,40.0,<=50K
1,34.0,11,2,7,0.0,3770.0,45.0,<=50K
2,38.0,0,2,0,0.0,3770.0,40.0,<=50K
3,45.0,10,2,9,0.0,3004.0,35.0,>50k
4,32.0,12,2,3,0.0,2824.0,55.0,>50k
...,...,...,...,...,...,...,...,...
9349,33.0,9,2,3,15024.0,0.0,60.0,>50k
9350,32.0,15,2,2,0.0,0.0,40.0,>50k
9351,25.0,8,2,2,0.0,0.0,45.0,<=50K
9352,37.0,9,2,11,0.0,0.0,60.0,>50k
9353,31.0,11,5,9,0.0,0.0,40.0,<=50K

In [129]:
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LogisticRegression

# Features and target
X = final_data.drop('income', axis=1)
y = final_data['income']

# Proper split (X, y separately)
X_train, X_test, y_train, y_test = train_test_split(
    X, y, test_size=0.2, random_state=42, stratify=y
)

In [130]:
logreg = LogisticRegression(max_iter=1000, solver="lbfgs")
logreg.fit(X_train, y_train)

y_pred = logreg.predict(X_test)
y_prob = logreg.predict_proba(X_test)[:, 1]  # for ROC-AUC

In [131]:
from sklearn.metrics import confusion_matrix, classification_report,precision_score,accuracy_score

print("Accuracy_score", accuracy_score(y_test,y_pred))

Accuracy_score 0.7952966328166756